<h5><strong>特定商取引法に基づく表示</strong></h5> </br></br>

<p><strong>1.&nbsp; 事業者の名称：</strong></p>
<ol>
    <li>株式会社サークルエデュ</li>
</ol>
<p>&nbsp;</p>

<p><strong>2.&nbsp; 代表者または通信販売に関する業務の責任者の氏名：</strong></p>
<ol>
    <li>代表取締役　　髙野大希</li>
</ol>
<p>&nbsp;</p>

<p><strong>3.&nbsp; 住所：</strong></p>
<ol>
    <li>東京都府中市寿町1-3-26 新第1福井ビル3階</li>
</ol>
<p>&nbsp;</p>

<p><strong>4.&nbsp; 電話番号：</strong></p>
<ol>
    <li>042-340-3095</li>
</ol>
<p>&nbsp;</p>

<p><strong>5.&nbsp; メールアドレス：</strong></p>
<ol>
    <li>info@circle-edu.com</li>
</ol>
<p>&nbsp;</p>

<p><strong>6.&nbsp; 商品の販売価格・サービスの対価：</strong></p>
<ol>
    <li>各商品・サービスのご購入ページにて表示する価格</li>
</ol>
<p>&nbsp;</p>

<p><strong>7.&nbsp; 対価以外に必要となる費用：</strong></p>
<ol>
    <li>インターネット接続料金、通信料金等はお客様のご負担となります。</li>
</ol>
<p>&nbsp;</p>

<p><strong>8.&nbsp; 支払方法：</strong></p>
<ol>
    <li>クレジット決済</li>
</ol>
<p>&nbsp;</p>

<p><strong>9.&nbsp; 代金の支払時期：</strong></p>
<ol>
    <li>ご利用のクレジットカードの締め日や契約内容により異なります。ご利用されるカード会社までお問い合わせください。</li>
</ol>
<p>&nbsp;</p>

<p><strong>10. 商品引渡しまたはサービス提供の時期：</strong></p>
<ol>
    <li>クレジットカード利用の承認が下りた後、配送が必要な場合は3日以内に発送します。配送が不要な場合は、クレジットカードの利用の承諾が下りた後、順次サービスが利用可能となります。</li>
</ol>
<p>&nbsp;</p>
<p>&nbsp;</p>

<p><strong>11.返品・キャンセルに関する特約：</strong></p>
<ol>
    <li>本サイトで販売する商品・サービスについては、購入手続完了後の返品またはキャンセルをお受けいたしません。なお、商品・サービスに瑕疵がある場合は、利用規約の定めに従って対応します。</li>
    <li>商品がソフトウェアの場合、動作環境及び必要スペックはご購入ページで表示しています。</li>
    <li>特別な販売条件または提供条件がある商品またはサービスについては、各商品またはサービスの購入ページにおいて条件を表示します。</li>
</ol>
<p>&nbsp;</p>