app/Services/VerifyUserService.php

insert into `users` (`email`, `password`, `role`, `name`, `kana`, `last_name`, `birthday`, `avatar`, `sex`, `tel`, `code`, `status`, `university_Code`, `faculty_code`, `edu_status`, `card_id`, `introduction`, `updated_at`, `created_at`) values ('mikidej463@lutota.com', '$2y$10$eZqKkeTSsES350FcgOuHa.jcSZs2o/tAKNyPQverdEkfV8K0nyeNy', 'teacher', 'phuong45698', 'aaaaa', 'Phuongaaa', '2001-3-3', '', 'others', '01234567891', 'T-00291359', 'pending', '1020', '46', '院生', 'https://edutossdemo.s3.ap-northeast-1.amazonaws.com/card_id/T-00291359.png', 'aaaaa', '2022-10-05 13:14:00', '2022-10-05 13:14:00')
---

            // create user

            $_account = User::create([
                'email' => $_verify_user->email,
                'password' => $_verify_user->password,
                'role' => EUser::TEACHER,
                'name' => $this->request->name,
                'kana' => $this->request->kana,
                'last_name' => $this->request->last_name,
                'birthday' => implode('-', $this->request->birthday),
                'avatar' => $_avatar,
                'sex' => $this->request->sex,
                'tel' => $this->request->tel,
                'code' => $_code,
                'status' => EUser::STATUS_PENDING,
                'university_Code' => $this->request->university_Code,
                'faculty_code' => $this->request->faculty_code,
                'edu_status' => $this->request->edu_status,
                'card_id' => $_card_id,
                'introduction' => $this->request->introduction
            ]);

insert into `user_subjects` (`subject_id`, `user_id`) values ('1', 55), ('2', 55), ('6', 55), ('7', 55)
---
            $_subject = collect($this->request->subject)->map(function ($val) use ($_account) {
                return ['subject_id' => $val, 'user_id' => $_account->id];
            })->toArray();
            $_account->userSubject()->insert($_subject);

insert into `bank_accounts` (`bank_code`, `branch_code`, `bank_account_number`, `bank_account_name`, `bank_account_type`, `user_id`, `updated_at`, `created_at`) values ('1100', '000', '0001234', 'aa', '2', 55, '2022-10-05 13:14:00', '2022-10-05 13:14:00')
select * from `bank_accounts` where `bank_accounts`.`user_id` = 55 and `bank_accounts`.`user_id` is not null and (`bank_code` = '1100' and `branch_code` = '000' and `bank_account_number` = '0001234' and `bank_account_name` = 'aa' and `bank_account_type` = '2') limit 1
---
            //bank account
            $_bank_account = $_account->bankAccount();

            $_bank_account->updateOrCreate(
                $this->request->only(
                    'bank_code',
                    'branch_code',
                    'bank_account_number',
                    'bank_account_name',
                    'bank_account_type'
                )
            );