app/Http/Controllers/Teacher/SettingController.php

    public function profile(SettingProfile $request)
    {

            $item = $this->_userRepo->fetchWhere(['id' => Auth::user()->id, 'status' => EUser::STATUS_ACTIVE])->with('userSubject')->first();
---
select * from `user_subjects` where `user_subjects`.`user_id` in (55)
select * from `users` where (`id` = 55 and `status` = 'active') and `users`.`deleted_at` is null limit 1

                    }

                    $_user_subject = $item->userSubject();
                    $_user_subject->delete();
                    $_user_subject->insert($_subject);
---
delete from `user_subjects` where `user_subjects`.`user_id` = 55 and `user_subjects`.`user_id` is not null
insert into `user_subjects` (`created_at`, `subject_id`, `user_id`) values ('2022-10-05 15:15:31', '1', 55), ('2022-10-05 15:15:31', '2', 55), ('2022-10-05 15:15:31', '3', 55), ('2022-10-05 15:15:31', '4', 55), ('2022-10-05 15:15:31', '5', 55), ('2022-10-05 15:15:31', '6', 55), ('2022-10-05 15:15:31', '7', 55), ('2022-10-05 15:15:31', '8', 55), ('2022-10-05 15:15:31', '9', 55), ('2022-10-05 15:15:31', '10', 55)