app/Http/Controllers/AuthController.php

update `users` set `access_token` = '427|pjehFltMHmqssEuJrvZLVbIU2c55ZQaHovOkU638', `users`.`updated_at` = '2022-10-05 13:14:00' where `id` = 55
---
    public function storeProfileTeacher(ProfileTeacherRequest $request, $token)
    {
        try {

            $_verify_user = $this->_verifyService->storeProfileTeacher($token);

            //event( new SendMailRegisterComplete( $_verify_user ) );

            $_token = $_verify_user->createToken('Token_' . $_verify_user->role )->plainTextToken;
            $_verify_user->access_token = $_token;
            $_verify_user->save();

select * from `users` where `email` = 'mikidej463@lutota.com' and `status` not in ('deleted') and `role` in ('teacher', 'student') and `users`.`deleted_at` is null limit 1
update `users` set `access_token` = '428|Z4WyYW0niUPDYTSQQlF70eiC6lfpnNlRNDlRamxJ', `users`.`updated_at` = '2022-10-05 15:11:44' where `id` = 55
---
    public function login(LoginRequest $request)
    {

        if (RateLimiter::tooManyAttempts($this->throttleKey(), self::maxAttempts))
                return abort(429);

        try {

            $_user =  User::where( 'email', $request->email)
                            ->whereNotIn('status', [ EUser::STATUS_DELETED ] )
                            ->whereIn('role',[ EUser::TEACHER, EUser::STUDENT  ])
                            ->first();

            if (!$_user)
                return redirect()->back()->withErrors( trans('common.error.password') );


            $_remember = isset($request->remember) ? true : false;



            if ( Auth::guard( $_user->role )->attempt(['email' => $request->email, 'password' => $request->password ], $_remember ) ){

                RateLimiter::clear($this->throttleKey());

                $_token = $_user->createToken('Token_' . $_user->role)->plainTextToken;
                $_user->access_token = $_token;
                $_user->save();

update `users` set `access_token` = '429|qSSBDGhPyhmU7ChIhQZfKselx7kJihMT6TJimqiT', `users`.`updated_at` = '2022-10-05 15:15:52' where `id` = 1
---
    public function loginAdmin(LoginRequest $request)
    {
        if (RateLimiter::tooManyAttempts($this->throttleKey(), self::maxAttempts))
                return abort(429);

        try {
            if (Auth::guard(EUser::ADMIN)->attempt(
                [
                    'email' => $request->email,
                    'password' => $request->password,
                    'role' => 'admin',
                    'status' => EUser::STATUS_ACTIVE
                ]
            ))
            {
                RateLimiter::clear($this->throttleKey());
                $user = Auth::guard(EUser::ADMIN)->user();
                $token = $user->createToken('Token_'.EUser::ADMIN)->plainTextToken;
                $user->access_token = $token;
                $user->save();