app/Models/SchoolMaster.php

select distinct `university_name` as `name`, `university_code` as `code` from `school_masters` where `school_masters`.`deleted_at` is null
---
     public function university()
     {
         return $this->distinct()->get(['university_name as name','university_code as code']);

select `id`, `faculty_name`, `faculty_code` from `school_masters` where `university_Code` = '1015' and `school_masters`.`deleted_at` is null
---
     public function faculty( $_university_Code )
     {
         return $this->where('university_Code', $_university_Code)->get(['id','faculty_name', 'faculty_code']);

select distinct * from `school_masters` where `university_Code` = 1020 and `school_masters`.`deleted_at` is null limit 1
---
     public function university_name($_university_Code)
     {
        return $this->distinct()->where('university_Code', $_university_Code)->first();