app/Models/User.php

select count(*) as aggregate from `user_ratings` where `user_ratings`.`user_id` = 55 and `user_ratings`.`user_id` is not null
---
    public function getPeopleRatingAttribute(){
        return '('.$this->Ratings()->count().'評価)';

select avg(`evaluation`) as aggregate from `user_ratings` where `user_ratings`.`user_id` = 55 and `user_ratings`.`user_id` is not null
---
    public function getRatingAttribute(){
        return  round( $this->Ratings()->avg('evaluation') , 1 );