app/Enums/EUser.php

select count(`id`) as aggregate from `users` where (`role` = 'teacher')
---
    public static function getCodeUser( string $role ):string
    {

        $_max = DB::table('users')->where(['role' => $role])->count('id')+1;