app/Http/Controllers/Admin/TeacherController.php

select count(*) as aggregate from `users` where (`role` = 'teacher' and `status` = 'pending') and `users`.`deleted_at` is null
---
	public function countApprove()
	{
		try {

			return $this->_userRepo->fetchWhere(['role' => EUser::TEACHER, 'status' => Euser::STATUS_PENDING])->count();

select * from `users` where (`role` = 'teacher' and `status` = 'pending') and `users`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users` where (`role` = 'teacher' and `status` = 'pending') and `users`.`deleted_at` is null
---
	public function indexApprove(Request $request)
	{
		try {

			$item = $this->_userRepo->fetchWhere(['role' => EUser::TEACHER, 'status' => EUser::STATUS_PENDING ])
									->search($request->only('name','email','approved_admin', 'percent_training'))
									->orderBy( $this->_order_by_default[0], $this->_order_by_default[1] )
									->paginate( $this->_limit );

select `subjects`.*, `user_subjects`.`user_id` as `laravel_through_key` from `subjects` inner join `user_subjects` on `user_subjects`.`subject_id` = `subjects`.`id` where `user_subjects`.`user_id` in (55)
---
	public function show(Request $request, $id)
	{
		try {

			$item = $this->_userRepo->fetchWhere([ 'id' => $id, 'role' => EUser::TEACHER])
					->with('subject')
					->withCount('videos','nominationRequests')->first();

select `subjects`.*, `user_subjects`.`user_id` as `laravel_through_key` from `subjects` inner join `user_subjects` on `user_subjects`.`subject_id` = `subjects`.`id` where `user_subjects`.`user_id` in (46)
---
	public function showApprove(Request $request, $id)
	{
		try {

			$item = $this->_userRepo->fetchWhere([ 'id' => $id, 'role' => EUser::TEACHER])
					->with('subject')
					->withCount('videos','nominationRequests')->first();

select * from `users` where (`id` = '46' and `role` = 'teacher') and `users`.`deleted_at` is null limit 1
update `users` set `edu_status` = '卒業', `approved_admin` = '2', `users`.`updated_at` = '2022-10-05 15:36:13' where `id` = 46
delete from `user_subjects` where `user_subjects`.`user_id` = 46 and `user_subjects`.`user_id` is not null
insert into `user_subjects` (`created_at`, `subject_id`, `user_id`) values ('2022-10-05 15:36:13', '1', 46), ('2022-10-05 15:36:13', '2', 46), ('2022-10-05 15:36:13', '6', 46), ('2022-10-05 15:36:13', '7', 46)
---
	public function updateAccount(EditProfileTeacherRequest $request, $id)
	{
		try {
			DB::beginTransaction();

				$item = $this->_userRepo->fetchWhere([ 'id' => $id, 'role' => EUser::TEACHER])->first();

				$item->update($request->only('name','kana','birthday','sex', 'edu_status', 'faculty_code', 'university_Code', 'approved_admin' ));

				$_subject = collect($request->subject)->map( function($val)use($item) { return ['subject_id' => $val, 'user_id' => $item->id, 'created_at' => Carbon::now() ];  } )->toArray();

				$_user_subject = $item->userSubject();
				$_user_subject->delete();
				$_user_subject->insert($_subject);

select * from `users` where (`id` = '55' and `role` = 'teacher') and `users`.`deleted_at` is null limit 1
update `users` set `status` = 'denied', `users`.`updated_at` = '2022-10-05 15:39:05' where `id` = 55
delete from `user_subjects` where `user_subjects`.`user_id` = 55 and `user_subjects`.`user_id` is not null
insert into `user_subjects` (`created_at`, `subject_id`, `user_id`) values ('2022-10-05 15:39:05', '1', 55), ('2022-10-05 15:39:05', '2', 55), ('2022-10-05 15:39:05', '3', 55), ('2022-10-05 15:39:05', '4', 55), ('2022-10-05 15:39:05', '5', 55), ('2022-10-05 15:39:05', '6', 55), ('2022-10-05 15:39:05', '7', 55), ('2022-10-05 15:39:05', '8', 55), ('2022-10-05 15:39:05', '9', 55), ('2022-10-05 15:39:05', '10', 55)
---
	public function update(Request $request, $id)
	{
		try {
			DB::beginTransaction();
				$item = $this->_userRepo->fetchWhere([ 'id' => $id, 'role' => EUser::TEACHER])->first();
				$item->update($request->only('email','name','kana','birthday','sex','status','university_Code','faculty_code','edu_status'));

				$_subject = collect($request->subject)->map( function($val)use($item) { return ['subject_id' => $val, 'user_id' => $item->id, 'created_at' => Carbon::now() ];  } )->toArray();

				$_user_subject = $item->userSubject();
				$_user_subject->delete();
				$_user_subject->insert($_subject);