app/Http/Controllers/Admin/UserController.php

select * from `users` where (`role` = 'admin' and `status` = 'active') and `users`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users` where (`role` = 'admin' and `status` = 'active') and `users`.`deleted_at` is null
---
	public function index(Request $request)
	{
		try {

			$item = $this->_userRepo->fetchWhere(['role' => EUser::ADMIN, 'status' => EUser::STATUS_ACTIVE])
			                        ->orderBy( $this->_order_by_default[0], $this->_order_by_default[1] )
									->paginate( $this->_limit );